In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

from sqlalchemy.engine import create_engine

# %matplotlib notebook

In [2]:
%load_ext sql
%config SqlMagic.displaylimit=50
%config SqlMagic.autopandas=True

In [3]:
%sql postgresql://imdb:imdb_admin@postgres:5432/imdb_database

In [4]:
connection = create_engine('postgresql://imdb:imdb_admin@postgres:5432/imdb_database')

You will need local copies of the csv files that populate the tables in this database, please [download](https://arch.library.northwestern.edu/downloads/44558d72q?locale=en) and unpack the tarball before proceeding with this exercise.

# Introduction to SQL (Structured Query Language)

##### Version 0.1

***

By Scott Coughlin (Northwestern IT Research Computing Services)  
20 July 2022

[Session 15](https://github.com/LSSTC-DSFP/LSSTC-DSFP-Sessions/tree/main/Sessions/Session15) is primarily concerned with handling our data with efficiency.

Ideally, for any and every task we want to desire solutions that operate *faster*.

This can be accomplished many different ways:

$~~~~~~$build algorithms that execute faster

$~~~~~~$spread calculations over many different computers simultaneously

$~~~~~~$find a compact storage solution for the data so it can be accessed more quickly

In our introduction to SQL we will start with simple queries of existing tables, and discuss creating your own tables using `pandas` as a challenge problem.

## Problem 1) IMDb Data

Throughout the session we will use information from the [Internet Movie Database (IMDb)](https://www.imdb.com/) to illustrate various principles regarding databases.

A quick note on the provenance of this data. The files we have used to populate this data set are from [this website](https://relational.fit.cvut.cz/dataset/IMDb) and it may not be a list of every single movie on IMDb (there are no movies after 2004).

#### Please note that you can make an SQL command call from a jupyter cell by adding "%sql" in front of the SQL command you want to run, see examples below
```
## Perform a SQL command and see the results of the query
%sql SELECT * FROM imbd_movies;

## If you save to a variable, in this case "result", then the variable will be a `pandas` DataFrame based on the result of the query
result = %sql SELECT * FROM imdb_directors ORDER BY first_name LIMIT 10; 
```

Please execute the cell below to list all of the table names in the imbd_database database. You will want these table names to answer the questions that follow.

In [5]:
%sql \dt

 * postgresql://imdb:***@postgres:5432/imdb_database
4 rows affected.

   Schema                   Name   Type Owner
0  public         imdb_directors  table  imdb
1  public            imdb_movies  table  imdb
2  public  imdb_movies_directors  table  imdb
3  public     imdb_movies_genres  table  imdb

**Problem 1a**

Using SQL, SELECT 10 movies from the imbd_movies table. Select 10 directors from imbd_directors and order by `first_name`.

In [6]:
imdb_movies = %sql SELECT * FROM imdb_movies;
imdb_directors = %sql SELECT * FROM imdb_directors
imdb_movies_directors = %sql SELECT * FROM imdb_movies_directors
imdb_movies_genres = %sql SELECT * FROM imdb_movies_genres

 * postgresql://imdb:***@postgres:5432/imdb_database
355146 rows affected.
 * postgresql://imdb:***@postgres:5432/imdb_database
86880 rows affected.
 * postgresql://imdb:***@postgres:5432/imdb_database
371180 rows affected.
 * postgresql://imdb:***@postgres:5432/imdb_database
395119 rows affected.

In [7]:
%sql SELECT * FROM imdb_movies LIMIT 10;

 * postgresql://imdb:***@postgres:5432/imdb_database
10 rows affected.

   movie_id                                 name  year  rank
0         0                                  #28  2002   0.0
1         1  #7 Train: An Immigrant Journey, The  2000   0.0
2         2                                    $  1971   6.4
3         3                        $1,000 Reward  1913   0.0
4         4                        $1,000 Reward  1915   0.0
5         5                        $1,000 Reward  1923   0.0
6         6                      $1,000,000 Duck  1971   5.0
7         7               $1,000,000 Reward, The  1920   0.0
8         8               $10,000 Under a Pillow  1921   0.0
9         9                          $100,000.00  1915   0.0

In [11]:
%sql SELECT * FROM imdb_directors ORDER BY first_name LIMIT 10;

 * postgresql://imdb:***@postgres:5432/imdb_database
10 rows affected.

   director_id first_name       last_name
0         7494         A.      Bistritsky
1        13355         A.       Champeaux
2         7125         A.       Bhimsingh
3         3728         A.           Babes
4         4871         A.      Barr-Smith
5         8026         A.          Bobrov
6         4175         A.    Balakrishnan
7         6779         A.           Berry
8         1114         A.     Aleksandrov
9        13475         A.  Chandrasekaran

**Problem 1b**

Using SQL, how many movies are there? How many directors are there?

In [142]:
%sql SELECT COUNT(*) FROM imdb_movies;

 * postgresql://imdb:***@postgres:5432/imdb_database
1 rows affected.

    count
0  355146

In [143]:
%sql SELECT COUNT(*) FROM imdb_directors;

 * postgresql://imdb:***@postgres:5432/imdb_database
1 rows affected.

   count
0  86880

**Problem 1c**

Using SQL, determine how many movies are there after the year 2000?

In [144]:
%sql SELECT COUNT(*) FROM imdb_movies WHERE year > 2000;

 * postgresql://imdb:***@postgres:5432/imdb_database
1 rows affected.

   count
0  39586

**Problem 1d**

How many different movie genres are there?

In [146]:
%sql SELECT COUNT(DISTINCT genre) FROM imdb_movies_genres;

 * postgresql://imdb:***@postgres:5432/imdb_database
1 rows affected.

   count
0     21

*Write your answer here*

## Problem 2) Joins

We started this exercise with a goal of being efficient. And yet, the data have been organized across 4 different files (each sheet is effectively a unique csv file).

**Problem 2a**

Join `imdb_movies` and `imdb_movies_genres` together

In [24]:
%sql SELECT * FROM imdb_movies as s \
INNER JOIN imdb_movies_genres as t \
ON s.movie_id = t.movie_id;

 * postgresql://imdb:***@postgres:5432/imdb_database
395119 rows affected.

        movie_id                    name  year  rank  movie_id      genre
0             13  $21 a Day Once a Month  1941   0.0        13  Animation
1             13  $21 a Day Once a Month  1941   0.0        13      Short
2             18              $40,000.00  1996   9.6        18     Comedy
3             31                   $pent  2000   4.3        31      Drama
4             73              burbs, The  1989   5.9        73     Comedy
...          ...                     ...   ...   ...       ...        ...
395114    378593                 arkadas  1971   0.0    378593      Drama
395115    378599             kisilik ask  2004   0.0    378599      Drama
395116    378604     tekerlekli bisiklet  1962   0.0    378604      Drama
395117    378605        yetimin izdirabi  1956   0.0    378605      Drama
395118    378610                nc sayfa  1999   7.0    378610      Drama

[395119 rows x 6 columns]

**Problem 2b**

Join `imdb_movies`, `imdb_movies_directors` and `imdb_directors` together

In [58]:
%sql SELECT * FROM imdb_movies as s \
INNER JOIN imdb_movies_directors as t ON s.movie_id = t.movie_id \
INNER JOIN imdb_directors as d ON t.director_id = d.director_id;

 * postgresql://imdb:***@postgres:5432/imdb_database
319125 rows affected.

,movie_id,name,year,rank,director_id,movie_id,director_id,first_name,last_name
0,131879,Goonda,1984,0.0,8,131879,8,Kodanda Rami Reddy,A.
1,179870,Kondaveeti Donga,1990,0.0,8,179870,8,Kodanda Rami Reddy,A.
2,247163,Palnati Simham,1985,0.0,8,247163,8,Kodanda Rami Reddy,A.
3,157146,Imperial Navy,1981,0.0,31,157146,31,Paul,Aaron
4,347746,Untamed Love,1994,0.0,31,347746,31,Paul,Aaron
...,...,...,...,...,...,...,...,...,...
319120,301476,Silah arkadaslari,1962,0.0,88777,301476,88777,Sinasi,Özonuk
319121,350837,Vatan fedaileri,1961,0.0,88777,350837,88777,Sinasi,Özonuk
319122,315351,Stopp (2001/II),2001,6.8,88781,315351,88781,Pål,Øie
319123,158959,Indbildt hanrej,1971,0.0,88787,158959,88787,Preben,Østerfelt
319124,307135,Soire musicale,1971,0.0,88787,307135,88787,Preben,Østerfelt

## Problem 3) Groups and Aggregates

Now that we know why the data has been organized in this way, we can leverage this unique structure in order to learn interesting properties of the data.

**Problem 3a**

In which year were the most movies made according to IMDb?

In [147]:
%sql SELECT year,COUNT(year) FROM imdb_movies \
GROUP BY year \
ORDER BY COUNT(year) DESC LIMIT 1;

 * postgresql://imdb:***@postgres:5432/imdb_database
1 rows affected.

   year  count
0  2002  10337

**Problem 3b**

How many "Action" movies where made after the year 1980? Before the year 1980?

In [148]:
%sql SELECT COUNT(*) FROM imdb_movies as m \
INNER JOIN imdb_movies_genres as g \
ON m.movie_id = g.movie_id \
WHERE g.genre='Action' AND year > 1980;

 * postgresql://imdb:***@postgres:5432/imdb_database
1 rows affected.

   count
0  10135

In [149]:
%sql SELECT COUNT(*) FROM imdb_movies as m \
INNER JOIN imdb_movies_genres as g \
ON m.movie_id = g.movie_id \
WHERE g.genre='Action' AND year < 1980;

 * postgresql://imdb:***@postgres:5432/imdb_database
1 rows affected.

   count
0   4090

*write your answer here*

**Problem 3c**

Select all films made by `Scorsese`. How many are there?

In [69]:
%sql SELECT COUNT(*) FROM imdb_directors as d \
INNER JOIN imdb_movies_directors as m \
ON d.director_id = m.director_id \
WHERE d.last_name='Scorsese';

 * postgresql://imdb:***@postgres:5432/imdb_database
1 rows affected.

   count
0     40

*write your answer here*

**Problem 3c**

According the the IMDb data, which director has directed the most movies?

In [152]:
%sql SELECT m.director_id,COUNT(m.movie_id) FROM imdb_movies_directors as m\
INNER JOIN imdb_directors as d\
ON d.director_id = m.director_id\
GROUP BY m.director_id \
ORDER BY COUNT(m.movie_id) DESC LIMIT 1;

 * postgresql://imdb:***@postgres:5432/imdb_database
1 rows affected.

   director_id  count
0        25116    616

*write your answer here*

**Problem 3d**

According the the IMDb data, which director has directed the most movies in each genre?

In [141]:
%sql SELECT g.genre,m.director_id,COUNT(m.movie_id) FROM imdb_movies_directors as m\
INNER JOIN imdb_movies_genres as g \
ON m.movie_id = g.movie_id\
GROUP BY g.genre, m.director_id \
ORDER BY g.genre,COUNT(m.movie_id) DESC;

 * postgresql://imdb:***@postgres:5432/imdb_database
154778 rows affected.

          genre  director_id  count
0        Action        21656     48
1        Action        13493     36
2        Action        34703     35
3        Action        64798     34
4        Action        47433     34
...         ...          ...    ...
154773  Western        21984      1
154774  Western        72974      1
154775  Western        29509      1
154776  Western        25462      1
154777  Western        87109      1

[154778 rows x 3 columns]

*write your answer here*

## Challenge Problem) Make your own tables

**Problem 1a**

Create a new TABLE.

In [153]:
%sql CREATE TABLE test_table1(column1 bigint, column2 text);

 * postgresql://imdb:***@postgres:5432/imdb_database
Done.

Empty DataFrame
Columns: []
Index: []

**Problem 1b**

INSERT 3 rows into the TABLE you made above

In [155]:
%sql INSERT INTO test_table1 VALUES(0,'a');
%sql INSERT INTO test_table1 VALUES(1,'b');

 * postgresql://imdb:***@postgres:5432/imdb_database
1 rows affected.
 * postgresql://imdb:***@postgres:5432/imdb_database
1 rows affected.

Empty DataFrame
Columns: []
Index: []

In [157]:
%sql SELECT * FROM test_table1;

 * postgresql://imdb:***@postgres:5432/imdb_database
2 rows affected.

   column1 column2
0        0       a
1        1       b

**Problem 1c**

Create a pandas DataFrame and save as a SQL table

*** hint look at the `pandas.to_sql` documentation and note that we already made a "connection" variable called `connection` ***